Repository: JosephMoraila/Postienda
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es_mx

source: No saved ticket was found.
es_mx: No se encontró ningún ticket guardado.

source: The ticket file could not be opened
es_mx: No se pudo abrir el archivo del ticket

source: No data.json file was found.
es_mx: No se encontró el archivo data.json.

source: The mode could not be obtained
es_mx: No se pudo obtener el modo

source: Invalid item format
es_mx: Formato de ítem no válido

source: Image not found: %s
es_mx: Imagen no encontrada: %s

source: Error creating device context for the selected printer.
es_mx: Error al crear el contexto del dispositivo para la impresora seleccionada.

source: Error starting print document.
es_mx: Error al iniciar el documento de impresión.

source: Error starting the print page.
es_mx: Error al iniciar la página de impresión.

source: Error creating the font for printing.
es_mx: Error al crear la fuente para la impresión.

source: Error opening printer:
es_mx: Error al abrir la impresora:

source: Error sending RAW data to the printer. Bytes written: %lu
es_mx: Error al enviar datos RAW a la impresora. Bytes escritos: %lu
