Repository: JosephMoraila/Postienda
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es_mx

source: Database error File: %s Line: %d Error message: %s
es_mx: Error de base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: You have not selected a valid printer.
es_mx: No has seleccionado una impresora válida.

source: Printing Error
es_mx: Error de impresión

source: No items found in ticket.
es_mx: No se encontraron elementos en el ticket.

source: An error occurred while retrieving mode.
es_mx: Ocurrió un error al obtener el modo.

source: Error printing the ticket:
es_mx: Error al imprimir el ticket:

source: You haven't created any products yet.
es_mx: Aún no has creado ningún producto.

source: Attention
es_mx: Atención

source: Warning
es_mx: Advertencia

source: Invalid barcode
es_mx: Código de barras inválido

source: Create password
es_mx: Crear contraseña

source: Password is empty
es_mx: Contraseña está vacía

source: Confirm password is empty
es_mx: Confirmar contraseña está vacío

source: Passwords are not the same
es_mx: Las contraseñas no son las mismas

source: Password stored securely
es_mx: Contraseña guardada seguramente

source: Error while processing password
es_mx: Error procesando contraseña

source: Create your password:
es_mx: Crea tu contraseña:

source: Confirm password:
es_mx: Confirma tu contraseña:

source: Accept
es_mx: Aceptar

source: Enter password
es_mx: Introduce contraseña

source: Incorrect password
es_mx: Contraseña incorrecta

source: Enter password:
es_mx: Introduce contraseña:

source: Info products
es_mx: Info Compras

source: The database was not found at:
es_mx: No se encontró la base de datos en:

source: Database error
es_mx: Error de base de datos

source: No purchases found. You have not done any purchase.
es_mx: No hay compras encontradas. No has hecho ninguna compra.

source: Table not found
es_mx: Tabla no encontrada

source: No purchases were found with the specified filters.
es_mx: No se encontraron compras con los filtros especificados.

source: No results
es_mx: Sin resultados

source: No more records available.
es_mx: No hay más registros disponibles.

source: End of results
es_mx: Fin de los resultados

source: An unknown error occurred while processing the purchase.
es_mx: Ocurrió un error desconocido al procesar la compra.

source: Start date:
es_mx: Fecha de inicio:

source: Start time:
es_mx: Hora de inicio:

source: End date:
es_mx: Fecha de fin:

source: End time:
es_mx: Hora de fin:

source: Minimum price:
es_mx: Precio mínimo:

source: Maximum price:
es_mx: Precio máximo:

source: Product name/barcode:
es_mx: Nombre/Código de barras del producto:

source: Highest to lowest
es_mx: Mayor a menor

source: Search
es_mx: Buscar

source: Product name
es_mx: Nombre del producto

source: Price
es_mx: Precio

source: Barcode
es_mx: Código de barras

source: Quantity sold
es_mx: Cantidad vendida

source: Load previous
es_mx: Cargar anteriores

source: Page: -/-
es_mx: Página: -/-

source: Load more
es_mx: Cargar más

source: Language
es_mx: Idioma

source: Could not write:
es_mx: No se pudo escribir

source: The language change will take effect after restarting the application.
es_mx: El cambio de idioma hará efecto después de que se reinicie la aplicación

source: Information
es_mx: Información

source: Select your language:
es_mx: Selecciona tu idioma

source: Close the windows Products before continuing
es_mx: Cierra las ventanas de Productos antes de continuar

source: That product with that barcode does not exist.
es_mx: Ese producto con ese código de barras no existe.

source: You can not add to cart a product without stock
es_mx: No puedes agregar al carrito un producto sin inventario

source: Grams
es_mx: Gramos

source: Do you want to enter the amount in kilograms or grams?
es_mx: ¿Deseas ingresar la cantidad en kilogramos o gramos?

source: Unit of measurement
es_mx: Unidad de medida

source: Enter the quantity in kilograms (example: 1.5):
es_mx: Ingresa la cantidad en kilogramos (ejemplo: 1.5):

source: Enter the amount in grams (example: 750):
es_mx: Ingresa la cantidad en gramos (ejemplo: 750):

source: Quantity
es_mx: Cantidad

source: Invalid quantity
es_mx: Cantidad inválida

source: Info
es_mx: Información

source: Error obtaining products:
es_mx: Error al obtener productos:

source: No products were found with that name..
es_mx: No se encontraron productos con ese nombre.

source: Advice
es_mx: Aviso

source: - Category:
es_mx: - Categoría:

source: - Barcode:
es_mx: - Código de barras:

source: Multiple products with that name were found. Choose one:
es_mx: Se encontraron múltiples productos con ese nombre. Elige uno:

source: Select product
es_mx: Seleccionar producto

source: Error creating cart table
es_mx: Error al crear la tabla del carrito

source: Error adding product to cart:
es_mx: Error al agregar producto al carrito:

source: Confirm
es_mx: Confirmar

source: Error emptying cart: %s
es_mx: Error al vaciar el carrito: %s

source: SQL error while emptying the cart Code: %d Message: %s
es_mx: Error SQL al vaciar el carrito Código: %d Mensaje: %s

source: The program did not close properly and there are items in the cart. Do you want to restore them?
es_mx: El programa no se cerró correctamente y hay elementos en el carrito. ¿Deseas restaurarlos?

source: Error creating the purchases table:
es_mx: Error al crear la tabla de compras:

source: Error registering purchase: %s
es_mx: Error al registrar la compra: %s

source: To access products, you need to empty your cart. Do you want to empty it and access?
es_mx: Para acceder a los productos, debes vaciar tu carrito. ¿Deseas vaciarlo y continuar?

source: Do you want to delete the selected item?
es_mx: ¿Deseas eliminar el elemento seleccionado?

source: Do you want to delete the selected items?
es_mx: ¿Deseas eliminar los elementos seleccionados?

source: Confirm deletion
es_mx: Confirmar eliminación

source: Cash
es_mx: Efectivo

source: Card
es_mx: Tarjeta

source: Select payment method:
es_mx: Selecciona método de pago:

source: Payment method
es_mx: Método de pago

source: Total: $%.2f Enter amount received:
es_mx: Total: $%.2f Ingresa el monto recibido:

source: Cash payment
es_mx: Pago en efectivo

source: Invalid amount, please try again.
es_mx: Monto inválido, por favor intenta nuevamente.

source: Purchase registered successfully. Total: $%.2f Paid: $%.2f Change: $%.2f
es_mx: Compra registrada exitosamente. Total: $%.2f Pagado: $%.2f Cambio: $%.2f

source: Purchase registered successfully. Total: $%.2f Paid with card.
es_mx: Compra registrada exitosamente. Total: $%.2f Pagado con tarjeta.

source: Purchase completed
es_mx: Compra completada

source: Error creating table: %s
es_mx: Error al crear la tabla: %s

source: You have products in your cart. Do you want to close? Cart items will be deleted.
es_mx: Tienes productos en tu carrito. ¿Deseas cerrar? Los elementos del carrito serán eliminados.

source: No canvas available by the moment. Select EscPos
es_mx: No canvas disponoble por el momento. Selecciona EscPos

source: No available
es_mx: No disponible

source: Error obtaining print mode
es_mx: Error al obtener el modo de impresión

source: The products could not be obtained.
es_mx: No se pudieron obtener los productos.

source: No items were found for this purchase.
es_mx: No se encontraron artículos para esta compra.

source: Total: $%s Paid: $%s Change: $%s Attended by: %s
es_mx: Total: $%s Pagado: $%s Cambio: $%s Atendido por: %s

source: Settings
es_mx: Configuración

source: Products
es_mx: Productos

source: Users
es_mx: Usuarios

source: View
es_mx: Ver

source: Previous purchases
es_mx: Compras anteriores

source: Info Products
es_mx: Info Compras

source: Appearance
es_mx: Apariencia

source: Light
es_mx: Claro

source: Dark
es_mx: Oscuro

source: System
es_mx: Sistema

source: Delete
es_mx: Eliminar

source: Make purchase
es_mx: Realizar compra

source: Enter name or barcode
es_mx: Ingresa nombre o código de barras

source: Product
es_mx: Producto

source: Previous Purchases
es_mx: Compras anteriores

source: Searching only for the ID cancels all other filters
es_mx: Buscar solo por ID cancela todos los demás filtros

source: Minimum amount:
es_mx: Monto mínimo:

source: Maximum amount:
es_mx: Monto máximo:

source: Worker:
es_mx: Empleado:

source: Date
es_mx: Fecha

source: Time
es_mx: Hora

source: Worker
es_mx: Empleado

source: Copy row
es_mx: Copiar fila

source: View purchase
es_mx: Ver compra

source: Copied to clipboard
es_mx: Copiado al portapapeles

source: Page: -
es_mx: Página: -/-

source: No purchases were found with the ID %llu.
es_mx: No se encontraron compras con el ID %llu.

source: An unknown error occurred while retrieving purchases.
es_mx: Ocurrió un error desconocido al obtener las compras.

source: Purchase ID: %llu
es_mx: ID de compra: %llu

source: Error loading purchase details:
es_mx: Error al cargar los detalles de la compra:

source: Unknown error loading purchase details.
es_mx: Error desconocido al cargar los detalles de la compra.

source: Total: %s Attended by: %s
es_mx: Total: %s Atendido por: %s

source: Print ticket
es_mx: Imprimir ticket

source: Name
es_mx: Nombre

source: Edit Product
es_mx: Editar producto

source: Price per kilo:
es_mx: Precio por kilo:

source: Price:
es_mx: Precio:

source: New product
es_mx: Nuevo producto

source: Name:
es_mx: Nombre:

source: Barcode (optional):
es_mx: Código de barras (opcional):

source: The barcode must contain only numbers and letters (maximum 20 characters).
es_mx: El código de barras debe contener solo números y letras (máximo 20 caracteres).

source: Product by weight?
es_mx: Producto por peso?

source: Cancel
es_mx: Cancelar

source: The product name cannot be empty or contain only spaces.
es_mx: El nombre del producto no puede estar vacío ni contener solo espacios.

source: The price must be a number greater than or equal to zero.
es_mx: El precio debe ser un número mayor o igual a cero.

source: The barcode cannot have more than 20 characters.
es_mx: El código de barras no puede tener más de 20 caracteres.

source: The barcode must contain at least one number or letter.
es_mx: El código de barras debe contener al menos un número o letra.

source: You cannot add a category within a product.
es_mx: No se puede agregar una categoría dentro de un producto.

source: Enter category name:
es_mx: Ingrese el nombre de la categoría:

source: New category
es_mx: Nueva categoría

source: Invalid name. Category was not created
es_mx: Nombre inválido. La categoría no fue creada.

source: There is already a category called '%s' at this level.
es_mx: Ya existe una categoría llamada '%s' en este nivel.

source: You cannot add a product inside another product.
es_mx: No se puede agregar un producto dentro de otro producto.

source: Invalid name. The product was not created.
es_mx: Nombre inválido. El producto no fue creado.

source: There is already a product called '%s' in this category.
es_mx: Ya existe un producto llamado '%s' en esta categoría.

source: The barcode '%s' is already in use by another product.
es_mx: El código de barras '%s' ya está en uso por otro producto.

source: Duplicated barcode
es_mx: Código de barras duplicado

source: There are no items selected to delete.
es_mx: No hay elementos seleccionados para eliminar.

source: Selected item is not valid.
es_mx: El elemento seleccionado no es válido.

source: Are you sure you want to delete the '%s' category?
es_mx: ¿Está seguro que desea eliminar la categoría '%s'?

source: Confirm Deletion
es_mx: Confirmar eliminación

source: N­ew category
es_mx: Nueva categoría

source: There is already a category with that name at this level.
es_mx: Ya hay una categoría con ese nombre en este nivel

source: Error getting stock: %s
es_mx: Error al vaciar el carrito: %s

source: Error deleting category from database File: %s Line: %d Error message: %s
es_mx: Error de base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: Error obtaining products: %s
es_mx: Error al obtener los productos: %s

source: Error inserting new category into database File: %s Line: %d Error message: %s
es_mx: Error al insertar la nueva categoría en la base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: Error inserting new product into database File: %s Line: %d Error message: %s
es_mx: Error al insertar el nuevo producto en la base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: Error inserting stock for the product into the database File: %s Line: %d Error message: %s
es_mx: Error al insertar el stock del producto en la base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: Error loading filtered tree File: %s Line: %d Error message: %s
es_mx: Error al cargar el árbol filtrado Archivo: %s Línea: %d Mensaje de error: %s

source: There is already a category with the same name at the same level.
es_mx: Ya existe una categoría con el mismo nombre en este nivel.

source: Error inserting category: %s
es_mx: Error al insertar la categoría: %s

source: There is already a product with the same name at the same level.
es_mx: Ya existe un producto con el mismo nombre en este nivel.

source: There is already a product with that barcode.
es_mx: Ya existe un producto con ese código de barras.

source: Error updating product: %s
es_mx: Error al actualizar el producto: %s

source: Error verifying the existence of a category in the database File: %s Line: %d Error message: %s
es_mx: Error al verificar la existencia de una categoría en la base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: Error verifying product existence in the database File: %s Line: %d Error message: %s
es_mx: Error al verificar la existencia del producto en la base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: Error verifying the existence of a barcode in the database File: %s Line: %d Error message: %s
es_mx: Error al verificar la existencia del código de barras en la base de datos Archivo: %s Línea: %d Mensaje de error: %s

source: Error adjusting stock: %s
es_mx: Error al ajustar el stock: %s

source: Error: Category father could not be obtained
es_mx: Error: No se pudo obtener la categoría padre

source: Are you sure you want to delete the product '
es_mx: ¿Estás seguro de que deseas eliminar el producto '

source: '­from the category '
es_mx: ' de la categoría '

source: Error: Category not found on item map
es_mx: Error: Categoría no encontrada en el mapa de elementos

source: Error: Pointer to father category is null
es_mx: Error: El puntero a la categoría padre es nulo

source: The product name is invalid. It must contain at least one valid character.
es_mx: El nombre del producto no es válido. Debe contener al menos un carácter válido.

source: Invalid name
es_mx: Nombre inválido

source: There is already a product with that name in this category.
es_mx: Ya existe un producto con ese nombre en esta categoría.

source: Duplicate Product
es_mx: Producto duplicado

source: Manage your products and categories. When registering a product, remember to update its inventory (stock).
es_mx: Administra tus productos y categorías. Al registrar un producto, recuerda actualizar su inventario (stock).

source: New Product
es_mx: Nuevo producto

source: Modify
es_mx: Modificar

source: Edit category
es_mx: Editar categoría

source: Edit product
es_mx: Editar producto

source: Edit stock
es_mx: Editar stock

source: Search:
es_mx: Buscar:

source: Enter category or product name, barcode, or price...
es_mx: Introduce nombre de categoría o producto, código de barras, o precio...

source: Clean
es_mx: Limpiar

source: Enter stock per kilo.
es_mx: Introduce el stock por kilo.

source: Enter stock per unit
es_mx: Introduce el stock por unidad

source: Product stock. Please note that it decreases as purchases are made.
es_mx: Stock del producto. Ten en cuenta que disminuye a medida que se realizan compras.

source: Sunday, 9/november/2025 16:14:30 Bread 1234 $99 Meat 4321 $199 Total: $288 Paid: $300 Change: $12 Attended by: Jose
es_mx: Domingo, 9/noviembre/2025 16:14:30 Pan 1234 $99 Carne 4321 $199 Total: $288 Pagado: $300 Cambio: $12 Atendido por: Jose

source: Purchase information has been added to the receipt. Please note that this is an example of how it will appear, as the actual receipt may be longer when purchasing many items, so the actual size may be longer than what you are editing.
es_mx: La información de la compra se ha añadido al recibo. Ten en cuenta que esto es un ejemplo de cómo aparecerá, ya que el recibo real puede ser más largo al comprar muchos artículos, por lo que el tamaño real puede ser mayor que lo que estás editando.

source: The ticket file could not be created
es_mx: No se pudo crear el archivo del ticket

source: Error saving image in memory
es_mx: Error al guardar la imagen en memoria

source: Error saving JSON: %s
es_mx: Error al guardar JSON: %s

source: Saving error: %s
es_mx: Error al guardar: %s

source: No ticket was found.
es_mx: No se encontró ningún ticket.

source: File ticket could not be opened
es_mx: No se pudo abrir el archivo del ticket

source: No data.json was found in the file
es_mx: No se encontró el archivo data.json dentro del archivo

source: Invalid items format
es_mx: Formato de ítems inválido

source: Image was not found: %s
es_mx: No se encontró la imagen: %s

source: Invalid EscPos Format
es_mx: Formato EscPos inválido

source: ESC/POS image not found in ZIP: %s
es_mx: Imagen ESC/POS no encontrada en el ZIP: %s

source: Unknown item format: %d
es_mx: Formato de ítem desconocido: %d

source: Error JSON reading ticket: %s
es_mx: Error al leer JSON del ticket: %s

source: Exception when reading the ticket: %s
es_mx: Excepción al leer el ticket: %s

source: Unknown error reading ticket
es_mx: Error desconocido al leer el ticket

source: Edit text
es_mx: Editar texto

source: Position below purchase information
es_mx: Posicionar debajo de la información de la compra

source: Activate to place text in the position it is in, but it will be placed below the purchase receipt. Since the purchase information has a variable size.
es_mx: Activa para colocar el texto en la posición indicada, pero se ubicará debajo del recibo de compra. Ya que la información de la compra tiene un tamaño variable.

source: Add text
es_mx: Añadir texto

source: No items found in ticket
es_mx: No se encontraron ítems en el ticket

source: There are no elements to print on the ticket.
es_mx: No hay elementos para imprimir en el ticket.

source: No printers were detected
es_mx: No se detectaron impresoras

source: Select a printer where the tickets will be printed:
es_mx: Seleccione una impresora donde se imprimirán los tickets:

source: Print receipt when making purchase
es_mx: Imprimir recibo al realizar la compra

source: Test print
es_mx: Impresión de prueba

source: If the ticket is not being printed, maybe you need to enable your user to use line printers on terminal. Try this command:
es_mx: Si el ticket no está siendo imprimido, tal vez necesitas habilitar tu usuario para usar la línea de impresoras en terminal. Intenta este comando:

source: Copy command
es_mx: Copiar comando

source: Please select a valid printer.
es_mx: Por favor seleccione una impresora válida.

source: Selection Error
es_mx: Error de selección

source: Ticket Settings
es_mx: Configuración de tickets

source: Error saving canvas ticket
es_mx: Error al guardar el ticket en el lienzo

source: Error saving EscPos ticket
es_mx: Error al guardar el ticket en formato EscPos

source: Add image
es_mx: Agregar imagen

source: Add purchase info
es_mx: Agregar información de la compra

source: Add purchase information. This can only be added once.
es_mx: Agregar información de la compra. Esto solo puede agregarse una vez.

source: Save
es_mx: Guardar

source: Change to EscPos
es_mx: Cambiar a EscPos

source: Width (mm):
es_mx: Ancho (mm):

source: Height (mm):
es_mx: Alto (mm):

source: Select Image
es_mx: Seleccionar imagen

source: Image files (*.png;*.jpg;*.jpeg;*.bmp;*.webp)|*.png;*.jpg;*.jpeg;*.bmp;*.webp
es_mx: Archivos de imagen (*.png;*.jpg;*.jpeg;*.bmp;*.webp)|*.png;*.jpg;*.jpeg;*.bmp;*.webp

source: Image could not be loaded.
es_mx: No se pudo cargar la imagen.

source: Purchase information is already on the receipt. It can only be added once.
es_mx: La información de la compra ya está en el recibo. Solo puede agregarse una vez.

source: [PURCHASE_INFO_STARTS] Sunday, 9/noviembre/2025 16:14:30 Bread 1234 $99 Meat 4321 $199 Total: $288 Paid: $300 Change: $12 Attended by: Jose [PURCHASE_INFO_FINISHES]
es_mx: [PURCHASE_INFO_STARTS] Domingo, 9/noviembre/2025 16:14:30 Pan 1234 $99 Carne 4321 $199 Total: $288 Pagado: $300 Cambio: $12 Atendido por: Jose [PURCHASE_INFO_FINISHES]

source: Purchase information is already on the receipt. It can only be added once..
es_mx: La información de la compra ya está en el recibo. Solo puede agregarse una vez.

source: The purchase information has been added to the receipt. Please note that this is just a preview of how it will look, as the actual receipt may become longer when a purchase includes many products, so the real size may be larger than what you are currently editing.
es_mx: La información de la compra ha sido agregada al recibo. Tenga en cuenta que esto es solo una vista previa de cómo se verá, ya que el recibo real puede ser más largo cuando la compra incluya muchos productos, por lo que el tamaño real puede ser mayor al que está editando actualmente.

source: Ticket saved successfully. If you want to test the ticket, click the "Settings" > "Test print" button.
es_mx: Ticket guardado con éxito. Si desea probar el ticket, haga clic en "Configuración" > "Impresión de prueba".

source: Success
es_mx: Éxito

source: Error loading ticket
es_mx: Error al cargar el ticket

source: Change Canvas
es_mx: Cambiar lienzo

source: Ticket file could not be opened
es_mx: No se pudo abrir el archivo del ticket

source: No data.json found in file
es_mx: No se encontró data.json en el archivo

source: The ticket file could not be written
es_mx: No se pudo escribir el archivo del ticket

source: ADD
es_mx: AGREGAR

source: DELETE
es_mx: ELIMINAR

source: User
es_mx: Usuario

source: SESSION:
es_mx: SESIÓN:

source: LOG IN
es_mx: INICIAR SESIÓN

source: LOG OUT OF ALL SESSIONS
es_mx: CERRAR TODAS LAS SESIONES

source: None
es_mx: Ninguno

source: Error connecting to the database: %s
es_mx: Error al conectar con la base de datos: %s

source: Name can not be empty
es_mx: El nombre no puede estar vacío

source: User name already exists, choose another one..
es_mx: El nombre de usuario ya existe, elija otro.

source: Error validating name: %s
es_mx: Error al validar el nombre: %s

source: User added successfully
es_mx: Usuario agregado con éxito

source: Error adding user: %s
es_mx: Error al agregar usuario: %s

source: No selected user to delete.
es_mx: No hay usuario seleccionado para eliminar.

source: Are you sure you want to delete the user?"
es_mx: ¿Está seguro de que desea eliminar al usuario?

source: Invalid user ID selected
es_mx: ID de usuario seleccionado no válido

source: You cannot delete a user who is currently logged in.
es_mx: No puede eliminar un usuario que actualmente ha iniciado sesión.

source: User successfully removed.
es_mx: Usuario eliminado con éxito.

source: Error deleting user: %s
es_mx: Error al eliminar usuario: %s

source: SESSION:
es_mx: SESIÓN:

source: No user selected to log in
es_mx: No se ha seleccionado un usuario para iniciar sesión

source: None:
es_mx: Ninguno:

source: Session started as:
es_mx: Sesión iniciada como:

source: Session
es_mx: Sesión

source: SESSIO:
es_mx: SESIÓN:

source: You have logged out, so purchases will not have an assigned user.
es_mx: Ha cerrado sesión, por lo que las compras no tendrán un usuario asignado.
